#!/usr/bin/env python
# _*_coding:utf-8_*_

#========================================
__author__ = 'Wang Xingbao'
__Date__ = 10 / 13 / 2016
#   Function:   
#========================================
# 人生有两种事，一种是想做的，一种是必须做的！
# 很多时候，我们必须做完必须做的事情，才有资本
# 去做想做的！

# so, 现实很残酷
# but......
# All growth is a leap in the dark!
# 所有的成长都是黑暗中的一跃
#========================================
# Be a loser for now or forever!
#========================================
import random


list1 = ["张","王","李","赵","刘","林","田","墨","越","曹","孟","孙","郭","于","段","易","周","吴","吕","朱","杨","黄","陈","诸葛","东方","欧阳","司马","上官","独孤","夏侯","闻人","尉迟","南宫","令狐","公孙","宇文","马","冯","米","沈","韩","秦","许"]
list2 = ["之桃","沛珊","慕灵","梦柏","冰兰","谷雪","书雪","千兰","半雪","凝芙","千凝","碧菡","芷卉","映之","凌瑶","无双","优璇","凝霜","落","影","依","馨月","诗韵","含颖","雅洁","静和","雪倩","梦雨","馨璐","涵之","安安","琳雅","芷萱","千羽","漫夜","若晴","斓依","娴珍","芸华","凌之","丹梅","凝易","梦夏","如蕾","孤竹","丹晴","尔梅","友春","思","梦","醉柔","问雁","听莲","觅烟","怀白","雨薇","海风","丹","念兰","代蓉","幼亦","依绿","凌"," 绮真","盼海","青","冬","映桃","亦真","慕玉","听琴","翠雁","晓槐","语","念阳","春芙","飞凝","醉竹","凌菱","雅荷","绮春","山薇","雅夏","涵霜","香柔","语雪","恨冬"," 寒春","飞莲","平天","念萱"]
list3 = ["文麒","德兴","伯懿","毅","逐天","辰","浩宇","瑾","皓轩","擎","擎宇","致远","烨","晟睿","博","天佑","杰","致","俊驰","雨泽","磊","伟","晟睿","文博","天佑","昊","修洁","黎昕","远航","旭尧","荣轩","泽","轩","睿","弘文","瀚","泽","瑞","绍辉","洋","鑫","鹏煊","博文","昊强","越泽","旭尧","宸","志泽","博超","君","子","鹏","炎","轩","伟泽","越彬","风","琪","明辉","伟诚","明轩","绍辉","柏","杰","修杰","志泽","弘文","峻熙","嘉懿","煜城","懿轩","烨伟","苑博","鹏涛","炎彬","鹤轩","伟泽","君昊","熠彤","鸿煊","博涛","苑杰","黎昕","霖","烨","煜祺","智宸","正豪","昊然","明杰"]
name = random.choice(list1)+random.choice(list2)

print "女反一号的名字是：",name

name = random.choice(list1)+random.choice(list3)

print "男反一号的名字是：",name